module.exports = {
  vendorName: 'Tanais',
  componentName: 'Chat',
  componentVersion: '1.0',
  // Описание контролов, которые есть в компоненте. Реализация контролов находится в папке ./src/controls.
  controls: [
    {
      name: 'ChatPage',
      // Загрузчики контрола. Загрузчик - это функция, принимающая информацию о контексте и точку доступа к API.
      // Задача загрузчика - смонтировать корневой UI-компонент контрола в указанный DOM-элемент.
      // Один и тот же контрол может отображаться в разных контекстах (карточка и обложка модуля).
      loaders: [
        {
          // Имя загрузчика должно соответствовать имени загрузчика в файле component.loaders.ts.
          name: 'chat-page-card-loader',
          // Контекст, для которого предназначен загрузчик.
          scope: 'Card'
        }
      ],
      displayNames: [
        { locale: 'en', name: 'Simple HTML page' },
        { locale: 'ru', name: 'Простая HTML страница' }
      ]
    }
  ]
};
